apk_analyzer/app/views/apps/index.html.erb

INSERT INTO "apps" ("filename", "package", "hasActivity", "hasRO", "numOfReceviers", "numOfServices", "numOfProviders", "createdPermissions", "usedPermissions", "bootCompleted", "persistent", "hasApplication", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
             <td><%= app.usedPermissions %></td>
             <td><%= app.createdPermissions %></td>