apk_analyzer/app/views/overview/index.html.erb

SELECT "apps".* FROM "apps"
---
<h2> apps </h2>
<% App.all.each do |app| %>